let questions = [
    {
        "question": "你喜歡在一個團隊中擔任領導角色嗎？",
        "answers": [
            ["非常喜歡", 5],
            ["喜歡", 4],
            ["一般", 3],
            ["不喜歡", 2],
            ["非常不喜歡", 1]
        ]
    },
    {
        "question": "在面對困難時，你會更傾向於遵循嘗試過的方法還是嘗試新的方法？",
        "answers": [
            ["遵循嘗試過的方法", 1],
            ["比較傾向遵循嘗試過的方法", 2],
            ["兩者皆可", 3],
            ["比較傾向嘗試新的方法", 4],
            ["嘗試新的方法", 5]
        ]
    },
    {
        "question": "你更喜歡計劃性的生活還是隨意的生活？",
        "answers": [
            ["計劃性的生活", 1],
            ["偏向計劃性的生活", 2],
            ["兩者之間", 3],
            ["偏向隨意的生活", 4],
            ["隨意的生活", 5]
        ]
    },
    {
        "question": "你在社交場合中通常是主動與他人交流還是等待他人主動與你交流？",
        "answers": [
            ["主動與他人交流", 5],
            ["比較主動與他人交流", 4],
            ["視情況而定", 3],
            ["比較被動與他人交流", 2],
            ["等待他人主動與我交流", 1]
        ]
    },
    {
        "question": "你更喜歡基於事實和邏輯做決定還是基於直覺和感覺做決定？",
        "answers": [
            ["基於事實和邏輯", 1],
            ["比較依賴事實和邏輯", 2],
            ["兩者兼顧", 3],
            ["比較依賴直覺和感覺", 4],
            ["基於直覺和感覺", 5]
        ]
    },

    {
        "question": "你喜歡在閒暇時嘗試新的興趣愛好嗎？",
        "answers": [
            ["非常喜歡", 5],
            ["喜歡", 4],
            ["一般", 3],
            ["不喜歡", 2],
            ["非常不喜歡", 1]
        ]
    },
    {
        "question": "你在學習新事物時更喜歡透過實踐還是透過理論？",
        "answers": [
            ["透過實踐", 5],
            ["偏向實踐", 4],
            ["兩者皆可", 3],
            ["偏向理論", 2],
            ["透過理論", 1]
        ]
    },
    {
        "question": "你是否容易受到情緒的影響？",
        "answers": [
            ["非常容易", 5],
            ["容易", 4],
            ["一般", 3],
            ["不容易", 2],
            ["非常不容易", 1]
        ]
    },
    {
        "question": "你是否會對未來有長遠的計劃和目標？",
        "answers": [
            ["總是有長遠的計劃和目標", 1],
            ["大多數時候有", 2],
            ["有時有，有時沒有", 3],
            ["很少有", 4],
            ["幾乎沒有", 5]
        ]
    },
    {
        "question": "你是否善於察覺他人的需求和情感？",
        "answers": [
            ["非常善於察覺", 5],
            ["善於察覺", 4],
            ["一般", 3],
            ["不太善於察覺", 2],
            ["非常不善於察覺", 1]
        ]
    }
];



